       01 DC-AUDIO-SOURCE PIC X(512).

       01 DC-OPUS-HANDLE.
          05 DC-OPUS-HANDLE-ID PIC 9(10) COMP-5.
          05 DC-OPUS-SOURCE PIC X(512).
          05 DC-OPUS-EOF-FLAG PIC 9.

       01 DC-OPUS-FRAME.
          05 DC-OPUS-LENGTH PIC 9(5) COMP-5.
          05 DC-OPUS-DATA PIC X(4096).
          05 DC-OPUS-DURATION-MS PIC 9(3) COMP-5.
