       01 DC-EVENT.
          05 DC-EVENT-NAME PIC X(64).
          05 DC-EVENT-SEQUENCE PIC S9(10) COMP-5.
          05 DC-EVENT-PAYLOAD-LENGTH PIC 9(5) COMP-5.
          05 DC-EVENT-PAYLOAD PIC X(8192).
