       IDENTIFICATION DIVISION.
       PROGRAM-ID. DC-JSON-TOKENIZE.

       DATA DIVISION.
       LINKAGE SECTION.
       01 DC-JSON-BUFFER-IN PIC X(8192).
       01 DC-JSON-TOKEN-COUNT PIC 9(5) COMP-5.
       COPY "discord-result.cpy".

       PROCEDURE DIVISION USING
           DC-JSON-BUFFER-IN
           DC-JSON-TOKEN-COUNT
           DC-RESULT.
       MAIN.
           MOVE 0 TO DC-JSON-TOKEN-COUNT
           CALL "DC-RESULT-OK" USING DC-RESULT
           GOBACK.
       END PROGRAM DC-JSON-TOKENIZE.
