       IDENTIFICATION DIVISION.
       PROGRAM-ID. DC-AUDIO-CLOCK-WAIT.

       DATA DIVISION.
       LINKAGE SECTION.
       01 DC-AUDIO-WAIT-MS PIC 9(10) COMP-5.
       COPY "discord-result.cpy".

       PROCEDURE DIVISION USING DC-AUDIO-WAIT-MS DC-RESULT.
       MAIN.
           CALL "DC-RESULT-OK" USING DC-RESULT
           GOBACK.
       END PROGRAM DC-AUDIO-CLOCK-WAIT.
