       IDENTIFICATION DIVISION.
       PROGRAM-ID. DC-AUDIO-PLAYER-INIT.

       DATA DIVISION.
       LINKAGE SECTION.
       COPY "discord-music.cpy".
       COPY "discord-result.cpy".

       PROCEDURE DIVISION USING DC-AUDIO-PLAYER DC-RESULT.
       MAIN.
           INITIALIZE DC-AUDIO-PLAYER
           MOVE 0 TO DC-PLAYER-STATE
           MOVE 100 TO DC-PLAYER-VOLUME
           CALL "DC-RESULT-OK" USING DC-RESULT
           GOBACK.
       END PROGRAM DC-AUDIO-PLAYER-INIT.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DC-AUDIO-PLAYER-STOP.

       DATA DIVISION.
       LINKAGE SECTION.
       COPY "discord-music.cpy".
       COPY "discord-result.cpy".

       PROCEDURE DIVISION USING DC-AUDIO-PLAYER DC-RESULT.
       MAIN.
           MOVE 3 TO DC-PLAYER-STATE
           CALL "DC-RESULT-OK" USING DC-RESULT
           GOBACK.
       END PROGRAM DC-AUDIO-PLAYER-STOP.
