       IDENTIFICATION DIVISION.
       PROGRAM-ID. DC-LOG.

       DATA DIVISION.
       LINKAGE SECTION.
       01 DC-LOG-LEVEL-IN PIC 9(2) COMP-5.
       01 DC-LOG-MESSAGE PIC X(256).

       PROCEDURE DIVISION USING DC-LOG-LEVEL-IN DC-LOG-MESSAGE.
       MAIN.
           DISPLAY "[discord.cob] "
               FUNCTION TRIM(DC-LOG-MESSAGE)
           END-DISPLAY
           GOBACK.
       END PROGRAM DC-LOG.
